// src/data/faq.ts
export interface FAQItem {
    id: number;
    question: string;
    answer: string;
}

export const faqItems: FAQItem[] = [
    {
        id: 1,
        question: "מי זכאי להטבה הזאת?",
        answer: "משרתי מילואים שביצעו לפחות 60 יום בצו 8 בשנת 2024 (לשובר של 2024), ומי שביצע 60 יום נוספים בשנת 2025 יקבל בעתיד שובר נוסף לשנה זו"
    },
    {
        id: 2,
        question: "כמה גודל השובר?",
        answer: "בשובר של 2024: במערך הלוחם, ללא ילדים 3,500 שח. בעלי ילדים 4,500 שח. בשאר היחידות: ללא ילדים 1,500 לבעלי ילדים 2,000 שח (כאשר בשובר של 2025, שעוד לא אושר, מסתמן ש: במערך הלוחם הסכום יישאר זהה ובשאר המערכים, 1,350 לבעלי ילדים ו1,050 למי שללא ילדים)",
    },
    {
        id: 3,
        question: "האם ניתן לפצל את השובר?",
        answer: "כן, ניתן לממש אותו חלקית. וגם ניתן לצרף מספר שוברים לעסקה אחת"
    },
    {
        id: 4,
        question: "עד מתי ניתן לממש?",
        answer: "עד 31.12.27"
    },
    {
        id: 5,
        question: "האם ניתן להשתמש בשובר לחופשה בחו״ל?",
        answer: "לא. השובר ניתן למימוש רק בארץ ורק לעסקים שמוגדרים בחברת האשראי כספקי לינה"
    },
    {
        id: 6,
        question: "למי אפשר לפנות אם עוד לא קבלתי?",
        answer: "אם לא קבלת את השובר עד לתאריך 11.5.25 ניתן לפנות למוקד המילואים בטלפון 1111 שלוחה 4 "
    },

];